# SpatialElement Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
SpatialElement Class
Members See Also
---
Represents an enclosed area or volume in the Revit model. This is the parent class for rooms, spaces and areas.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public class SpatialElement : Element
```

Visual Basic
---
```text
Public Class SpatialElement _
	Inherits Element
```

Visual C++
---
```text
public ref class SpatialElement : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..SpatialElement Autodesk.Revit.DB.Architecture..::..Room Autodesk.Revit.DB..::..Area Autodesk.Revit.DB.Mechanical..::..Space
# See Also
SpatialElement Members
Autodesk.Revit.DB Namespace